soap-api-update.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <urn:SessionHeader>
            <urn:sessionId>{{SessionId}}</urn:sessionId>
        </urn:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <urn:update>
            <urn:sObjects xsi:type="urn1:Account">
                <Phone>+65 9876 5432</Phone>
                <BillingCity>Singapore</BillingCity>
                <BillingCountry>Singapore</BillingCountry>
                <BillingPostalCode>339510</BillingPostalCode>
                <Id>[AccountIdFromYourOrg]</Id>
            </urn:sObjects>
            <urn:sObjects xsi:type="urn1:Lead">
                <Title>Director</Title>
                <Email>daniel.longan@digicom.com</Email>
                <MobilePhone>+65 8500 2500</MobilePhone>
                <Id>[LeadIdFromYourOrg]</Id>
            </urn:sObjects>
        </urn:update>
    </soapenv:Body>
</soapenv:Envelope>
